ErpTest/src/Documents/уатОтклонениеГруза/уатОтклонениеГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатОтклонениеГруза</name>
  <comment>Закрытие заказов на ТС</comment>
  <basedOn>Document.уатЗаказГрузоотправителя</basedOn>
  <registerRecords>AccumulationRegister.уатЗаказыГрузоотправителей</registerRecords>
  <registerRecords>InformationRegister.уатПричиныОтклоненияЗаказов</registerRecords>
  <attributes>
    <name>Заказчик</name>
    <comment>Заказчик</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>ЗаказГрузоотправителя</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтклонения</name>
      <comment>Причина закрытия</comment>
      <type>
        <types>CatalogRef.уатПричиныЗакрытияЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/AccumulationRegisters/уатЗаказыГрузоотправителей/уатЗаказыГрузоотправителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>уатЗаказыГрузоотправителей</name>
  <comment>(уат)</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказГрузоотправителя</name>
    <comment>Только родительский грузы (не этапы)</comment>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <comment>Единица измерения</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ErpTest/src/InformationRegisters/уатПричиныОтклоненияЗаказов/уатПричиныОтклоненияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатПричиныОтклоненияЗаказов</name>
  <comment>(уат)</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.уатПричиныЗакрытияЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.уатЗаказГрузоотправителя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Documents/уатОтклонениеГруза/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	уатЗаказыГрузоотправителейОстатки.Контрагент,
	|	уатЗаказыГрузоотправителейОстатки.ЗаказГрузоотправителя,
	|	уатЗаказыГрузоотправителейОстатки.Номенклатура,
	|	уатЗаказыГрузоотправителейОстатки.ЕдиницаИзмерения,
	|	уатЗаказыГрузоотправителейОстатки.КоличествоОстаток КАК Количество,
	|	уатОтклонениеГрузаЗаказы.Ссылка КАК Регистратор,
	|	уатОтклонениеГрузаЗаказы.Ссылка.Дата КАК Период,
	|	уатОтклонениеГрузаЗаказы.ПричинаОтклонения КАК ПричинаОтклонения,
	|	уатОтклонениеГрузаЗаказы.ЗаказГрузоотправителя.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.уатЗаказыГрузоотправителей.Остатки(
	|			&МоментВремени,
	|			Контрагент = &Заказчик
	|				И ЗаказГрузоотправителя В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						уатОтклонениеГрузаЗаказы.ЗаказГрузоотправителя
	|					ИЗ
	|						Документ.уатОтклонениеГруза.Заказы КАК уатОтклонениеГрузаЗаказы
	|					ГДЕ
	|						уатОтклонениеГрузаЗаказы.Ссылка = &Ссылка)) КАК уатЗаказыГрузоотправителейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатОтклонениеГруза.Заказы КАК уатОтклонениеГрузаЗаказы
	|		ПО уатЗаказыГрузоотправителейОстатки.ЗаказГрузоотправителя = уатОтклонениеГрузаЗаказы.ЗаказГрузоотправителя
	|ГДЕ
	|	уатОтклонениеГрузаЗаказы.Ссылка = &Ссылка";	
	
	мЗапрос.УстановитьПараметр("Ссылка"       , ДокументСсылка);
	мЗапрос.УстановитьПараметр("МоментВремени", ДокументСсылка.МоментВремени());
	мЗапрос.УстановитьПараметр("Заказчик"     , ДокументСсылка.Заказчик);
	
	ТаблицаЗаказовГрузоотправителя = мЗапрос.Выполнить().Выгрузить();   
	ТабПричины = ТаблицаЗаказовГрузоотправителя.Скопировать();
	//ТабЗаказыНаТС = ТаблицаЗаказовГрузоотправителя.Скопировать();
	
	// заказы грузоотправителя
	ТаблицаЗаказовГрузоотправителя.Колонки.Удалить("ПричинаОтклонения");
	
	ТабПричины.Колонки.Удалить("Контрагент");
	ТабПричины.Колонки.Удалить("ЕдиницаИзмерения");
	ТабПричины.Колонки.Удалить("ВидДвижения");
	ТабПричины.Колонки.Удалить("ДоговорКонтрагента");
	ТабПричины.Колонки.ЗаказГрузоотправителя.Имя = "Заказ";
	ТабПричины.Свернуть("Период, Регистратор, Заказ, Номенклатура, ПричинаОтклонения", "Количество");
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатЗаказыГрузоотправителей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаЗаказовГрузоотправителя;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Контрагент", "Контрагент");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ЗаказГрузоотправителя", "ЗаказГрузоотправителя");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.уатПричиныОтклоненияЗаказов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТабПричины;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Блокировка.Заблокировать();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаказовГрузоотправителя", ТаблицаЗаказовГрузоотправителя);
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПричинЗакрытия", 		  ТабПричины);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Заглушка = Истина;
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Заглушка = Истина;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
